src/Catalogs/Студенты/Студенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Студенты</name>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Специальность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>группа_студ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>датаЗачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Гражданство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтудента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексВБД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Студенты/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	// выгрузка данных
	Текст = Новый ТекстовыйДокумент;

	Студент = Справочники.Студенты.Выбрать();
    ПутьКФайлу = "C:\Users\angel\Downloads\sv\task4\Выгруженные_Данные.txt";

	Пока Студент.Следующий() Цикл
        Строка = Студент.Фамилия + ";" + Студент.Имя + ";" + Студент.Отчество + ";" + Студент.Факультет 
        + ";" + Студент.Специальность + ";" + Студент.группа_студ + ";" 
        + Студент.ФормаОбучения + ";" + Формат(Студент.датаЗачисления, "ДФ=dd.MM.yyyy") + ";" 
        + Студент.Гражданство + ";" + Студент.НомерСтудента + ";" + Студент.ТипОплаты + ";" + Студент.ИндексВБД;
        Текст.ДобавитьСтроку(Строка);
    КонецЦикла;
    Текст.Записать(ПутьКФайлу)	
КонецПроцедуры


&НаКлиенте
Процедура Команда2(Команда)
	Команда2НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда2НаСервере()
	// загрузка данных 
    ПутьКФайлу = "C:\Users\angel\Downloads\sv\task4\Данные_для_загрузки.txt";
	ФайлТекста = Новый Файл(ПутьКФайлу);
	СтрокиФайла = ФайлТекста.Прочитать();

	Для Каждого Строка Из СтрокиФайла Цикл
	    ПоляСтроки = Строка.Разделить(";");
	
	    Фамилия = ПоляСтроки[0];
	    Имя = ПоляСтроки[1];
	    Отчество = ПоляСтроки[2];
	    Факультет = ПоляСтроки[3];
	    Специальность = ПоляСтроки[4];
	    группа_студ = ПоляСтроки[5];
	    ФормаОбучения = ПоляСтроки[6];
	    датаЗачисления = Дата(ПоляСтроки[7]);
	    Гражданство = ПоляСтроки[8];
	    НомерСтудента = ПоляСтроки[9];
	    ТипОплаты = ПоляСтроки[10];
	    ИндексВБД = ПоляСтроки[11];
	
	    студ_статус = Справочники.Студенты.НайтиПоНомеруСтудента(НомерСтудента);
	    Если Не студ_статус Тогда
	        НовыйСтудент = Справочники.Студенты.СоздатьЭлемент();
	        НовыйСтудент.Фамилия = Фамилия;
	        НовыйСтудент.Имя = Имя;
	        НовыйСтудент.Отчество = Отчество;
	        НовыйСтудент.Факультет = Факультет;
	        НовыйСтудент.Специальность = Специальность;
	        НовыйСтудент.Группа = группа_студ;
	        НовыйСтудент.ФормаОбучения = ФормаОбучения;
	        НовыйСтудент.ДатаЗачисления = ДатаЗачисления;
	        НовыйСтудент.Гражданство = Гражданство;
	        НовыйСтудент.НомерСтудента = НомерСтудента;
	        НовыйСтудент.ТипОплаты = ТипОплаты;
	        НовыйСтудент.ИндеИндексВБД = ИндексВБД;
	        НовыйСтудент.ИмяФамилияОтчество = Имя + Фамилия + Отчество;
	        НовыйСтудент.Группа = группа_студ;
	        НовыйСтудент.Записать();
	    КонецЕсли;
	КонецЦикла;
	
	Сообщить("Данные успешно загружены из файла " + ПутьКФайлу);
		
КонецПроцедуры
